cmsis-svd/cmsis-svd/data/Nuvoton/NUC2201AE_v1.svd
       <register derivedFrom="PDMA_DAR0">
          <name>PDMA_DAR1</name>
          <displayName>PDMA_DAR1</displayName>
          <description>PDMA Channel x Destination Address Register</description>
          <alternateRegister>PDMA_DAR0</alternateRegister>
          <addressOffset>0x8</addressOffset>
       </register>
       <register derivedFrom="PDMA_DAR0">
          <name>PDMA_DAR2</name>
          <displayName>PDMA_DAR2</displayName>
          <description>PDMA Channel x Destination Address Register</description>
          <alternateRegister>PDMA_DAR0</alternateRegister>
          <addressOffset>0x8</addressOffset>
       </register>
       <register derivedFrom="PDMA_DAR0">
          <name>PDMA_DAR3</name>
          <displayName>PDMA_DAR3</displayName>
          <description>PDMA Channel x Destination Address Register</description>
          <alternateRegister>PDMA_DAR0</alternateRegister>
          <addressOffset>0x8</addressOffset>
       </register>
       <register derivedFrom="PDMA_DAR0">
          <name>PDMA_DAR4</name>
          <displayName>PDMA_DAR4</displayName>
          <description>PDMA Channel x Destination Address Register</description>
          <alternateRegister>PDMA_DAR0</alternateRegister>
          <addressOffset>0x8</addressOffset>
       </register>
       <register derivedFrom="PDMA_DAR0">
          <name>PDMA_DAR5</name>
          <displayName>PDMA_DAR5</displayName>
          <description>PDMA Channel x Destination Address Register</description>
          <alternateRegister>PDMA_DAR0</alternateRegister>
          <addressOffset>0x8</addressOffset>
       </register>
       <register derivedFrom="PDMA_DAR0">
          <name>PDMA_DAR6</name>
          <displayName>PDMA_DAR6</displayName>
          <description>PDMA Channel x Destination Address Register</description>
          <alternateRegister>PDMA_DAR0</alternateRegister>
          <addressOffset>0x8</addressOffset>
       </register>
       <register derivedFrom="PDMA_DAR0">
          <name>PDMA_DAR7</name>
          <displayName>PDMA_DAR7</displayName>
          <description>PDMA Channel x Destination Address Register</description>
          <alternateRegister>PDMA_DAR0</alternateRegister>
          <addressOffset>0x8</addressOffset>
       </register>
       <register derivedFrom="PDMA_DAR0">
          <name>PDMA_DAR8</name>
          <displayName>PDMA_DAR8</displayName>
          <description>PDMA Channel x Destination Address Register</description>
          <alternateRegister>PDMA_DAR0</alternateRegister>
          <addressOffset>0x8</addressOffset>
       </register>
       <register>
          <name>PDMA_BCR0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_BCR0</displayName>
          <description>PDMA Channel x Transfer Byte Count Register</description>
          <addressOffset>0xC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDMA_BCR</name>
              <description>PDMA Transfer Byte Count Register\nThis field indicates a 16-bit transfer byte count number of PDMA; it must be word alignment.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PDMA_BCR0">
          <name>PDMA_BCR1</name>
          <displayName>PDMA_BCR1</displayName>
          <description>PDMA Channel x Transfer Byte Count Register</description>
          <alternateRegister>PDMA_BCR0</alternateRegister>
          <addressOffset>0xC</addressOffset>
       </register>
       <register derivedFrom="PDMA_BCR0">
          <name>PDMA_BCR2</name>
          <displayName>PDMA_BCR2</displayName>
          <description>PDMA Channel x Transfer Byte Count Register</description>
          <alternateRegister>PDMA_BCR0</alternateRegister>
          <addressOffset>0xC</addressOffset>
       </register>
       <register derivedFrom="PDMA_BCR0">
          <name>PDMA_BCR3</name>
          <displayName>PDMA_BCR3</displayName>
          <description>PDMA Channel x Transfer Byte Count Register</description>
          <alternateRegister>PDMA_BCR0</alternateRegister>
          <addressOffset>0xC</addressOffset>
       </register>
       <register derivedFrom="PDMA_BCR0">
          <name>PDMA_BCR4</name>
          <displayName>PDMA_BCR4</displayName>
          <description>PDMA Channel x Transfer Byte Count Register</description>
          <alternateRegister>PDMA_BCR0</alternateRegister>
          <addressOffset>0xC</addressOffset>
       </register>
       <register derivedFrom="PDMA_BCR0">
          <name>PDMA_BCR5</name>
          <displayName>PDMA_BCR5</displayName>
          <description>PDMA Channel x Transfer Byte Count Register</description>
          <alternateRegister>PDMA_BCR0</alternateRegister>
          <addressOffset>0xC</addressOffset>
       </register>
       <register derivedFrom="PDMA_BCR0">
          <name>PDMA_BCR6</name>
          <displayName>PDMA_BCR6</displayName>
          <description>PDMA Channel x Transfer Byte Count Register</description>
          <alternateRegister>PDMA_BCR0</alternateRegister>
          <addressOffset>0xC</addressOffset>
       </register>
       <register derivedFrom="PDMA_BCR0">
          <name>PDMA_BCR7</name>
          <displayName>PDMA_BCR7</displayName>
          <description>PDMA Channel x Transfer Byte Count Register</description>
          <alternateRegister>PDMA_BCR0</alternateRegister>
          <addressOffset>0xC</addressOffset>
       </register>
       <register derivedFrom="PDMA_BCR0">
          <name>PDMA_BCR8</name>
          <displayName>PDMA_BCR8</displayName>
          <description>PDMA Channel x Transfer Byte Count Register</description>
          <alternateRegister>PDMA_BCR0</alternateRegister>
          <addressOffset>0xC</addressOffset>
       </register>
       <register>
          <name>PDMA_POINT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_POINT0</displayName>
          <description>PDMA Channel x Internal Buffer Pointer Register</description>
          <addressOffset>0x10</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>PDMA_POINT</name>
              <description>PDMA Internal Buffer Pointer Register (Read Only)\nThis field indicates the internal buffer pointer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
