cmsis-svd/cmsis-svd/data/Nuvoton/NUC2201AE_v1.svd
       <register derivedFrom="PDMA_ISR0">
          <name>PDMA_ISR1</name>
          <displayName>PDMA_ISR1</displayName>
          <description>PDMA Channel x Interrupt Status Register</description>
          <alternateRegister>PDMA_ISR0</alternateRegister>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="PDMA_ISR0">
          <name>PDMA_ISR2</name>
          <displayName>PDMA_ISR2</displayName>
          <description>PDMA Channel x Interrupt Status Register</description>
          <alternateRegister>PDMA_ISR0</alternateRegister>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="PDMA_ISR0">
          <name>PDMA_ISR3</name>
          <displayName>PDMA_ISR3</displayName>
          <description>PDMA Channel x Interrupt Status Register</description>
          <alternateRegister>PDMA_ISR0</alternateRegister>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="PDMA_ISR0">
          <name>PDMA_ISR4</name>
          <displayName>PDMA_ISR4</displayName>
          <description>PDMA Channel x Interrupt Status Register</description>
          <alternateRegister>PDMA_ISR0</alternateRegister>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="PDMA_ISR0">
          <name>PDMA_ISR5</name>
          <displayName>PDMA_ISR5</displayName>
          <description>PDMA Channel x Interrupt Status Register</description>
          <alternateRegister>PDMA_ISR0</alternateRegister>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="PDMA_ISR0">
          <name>PDMA_ISR6</name>
          <displayName>PDMA_ISR6</displayName>
          <description>PDMA Channel x Interrupt Status Register</description>
          <alternateRegister>PDMA_ISR0</alternateRegister>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="PDMA_ISR0">
          <name>PDMA_ISR7</name>
          <displayName>PDMA_ISR7</displayName>
          <description>PDMA Channel x Interrupt Status Register</description>
          <alternateRegister>PDMA_ISR0</alternateRegister>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="PDMA_ISR0">
          <name>PDMA_ISR8</name>
          <displayName>PDMA_ISR8</displayName>
          <description>PDMA Channel x Interrupt Status Register</description>
          <alternateRegister>PDMA_ISR0</alternateRegister>
          <addressOffset>0x24</addressOffset>
       </register>
       <register>
          <name>PDMA_SBUF0_C0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_SBUF0_C0</displayName>
          <description>PDMA Channel x Shared Buffer FIFO 0 Register</description>
          <addressOffset>0x80</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDMA_SBUF0</name>
              <description>PDMA Shared Buffer FIFO 0 (Read Only)\nEach channel has its own 1 word internal buffer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PDMA_SBUF0_C0">
          <name>PDMA_SBUF0_C1</name>
          <displayName>PDMA_SBUF0_C1</displayName>
          <description>PDMA Channel x Shared Buffer FIFO 0 Register</description>
          <alternateRegister>PDMA_SBUF0_C0</alternateRegister>
          <addressOffset>0x80</addressOffset>
       </register>
       <register derivedFrom="PDMA_SBUF0_C0">
          <name>PDMA_SBUF0_C2</name>
          <displayName>PDMA_SBUF0_C2</displayName>
          <description>PDMA Channel x Shared Buffer FIFO 0 Register</description>
          <alternateRegister>PDMA_SBUF0_C0</alternateRegister>
          <addressOffset>0x80</addressOffset>
       </register>
       <register derivedFrom="PDMA_SBUF0_C0">
          <name>PDMA_SBUF0_C3</name>
          <displayName>PDMA_SBUF0_C3</displayName>
          <description>PDMA Channel x Shared Buffer FIFO 0 Register</description>
          <alternateRegister>PDMA_SBUF0_C0</alternateRegister>
          <addressOffset>0x80</addressOffset>
       </register>
       <register derivedFrom="PDMA_SBUF0_C0">
          <name>PDMA_SBUF0_C4</name>
          <displayName>PDMA_SBUF0_C4</displayName>
          <description>PDMA Channel x Shared Buffer FIFO 0 Register</description>
          <alternateRegister>PDMA_SBUF0_C0</alternateRegister>
          <addressOffset>0x80</addressOffset>
       </register>
       <register derivedFrom="PDMA_SBUF0_C0">
          <name>PDMA_SBUF0_C5</name>
          <displayName>PDMA_SBUF0_C5</displayName>
          <description>PDMA Channel x Shared Buffer FIFO 0 Register</description>
          <alternateRegister>PDMA_SBUF0_C0</alternateRegister>
          <addressOffset>0x80</addressOffset>
       </register>
       <register derivedFrom="PDMA_SBUF0_C0">
          <name>PDMA_SBUF0_C6</name>
          <displayName>PDMA_SBUF0_C6</displayName>
          <description>PDMA Channel x Shared Buffer FIFO 0 Register</description>
          <alternateRegister>PDMA_SBUF0_C0</alternateRegister>
          <addressOffset>0x80</addressOffset>
       </register>
       <register derivedFrom="PDMA_SBUF0_C0">
          <name>PDMA_SBUF0_C7</name>
          <displayName>PDMA_SBUF0_C7</displayName>
          <description>PDMA Channel x Shared Buffer FIFO 0 Register</description>
          <alternateRegister>PDMA_SBUF0_C0</alternateRegister>
          <addressOffset>0x80</addressOffset>
       </register>
       <register derivedFrom="PDMA_SBUF0_C0">
          <name>PDMA_SBUF0_C8</name>
          <displayName>PDMA_SBUF0_C8</displayName>
          <description>PDMA Channel x Shared Buffer FIFO 0 Register</description>
          <alternateRegister>PDMA_SBUF0_C0</alternateRegister>
          <addressOffset>0x80</addressOffset>
       </register>
